[
  {
    "id": "1",
    "title": "Compliance workflow automation for legal document processing",
    "role": "Founder & Lead Engineer",
    "period": "Sept 2025 - Present",
    "location": "Mumbai, India",
    "whatWasBroken": "Legal teams processing 100+ page contracts manually. Reviews took days, errors slipped through, no audit trail.",
    "whyAutomationFailed": "Off-the-shelf AI parsers hallucinated on edge cases. Silent failures meant bad extractions went unnoticed. No human checkpoint before downstream actions.",
    "whatIBuilt": "Multi-agent pipeline with confidence-based routing. Extractions below 80% confidence auto-flag for human review. Durable state so nothing gets lost mid-process.",
    "outcome": "95%+ parsing accuracy on structured fields. Shipped production MVP in 6 weeks. Real users processing real contracts.",
    "tech": ["React", "Next.js", "Firebase", "GPT-4 API", "Vercel"],
    "type": "work"
  },
  {
    "id": "2",
    "title": "Distributed workflow engine for long-running AI processes",
    "role": "Lead Engineer",
    "period": "Oct 2025",
    "location": "Remote",
    "whatWasBroken": "AI workflows dying mid-execution. No way to pause, resume, or replay. Operators blind to what was happening inside the system.",
    "whyAutomationFailed": "Cron jobs with no state. When processes crashed, they lost everything. Retries meant re-running from scratch.",
    "whatIBuilt": "Event-driven architecture with pause/resume/replay. Automatic retry logic. Real-time dashboard showing workflow state. 50+ concurrent processes managed reliably.",
    "outcome": "Sub-200ms API response times under load. Zero silent failures. Operators can see exactly where things are.",
    "tech": ["FastAPI", "Temporal Cloud", "Redis", "PostgreSQL", "React", "TypeScript"],
    "type": "work"
  },
  {
    "id": "3",
    "title": "Research collaboration platform replacing spreadsheet chaos",
    "role": "Technical Lead",
    "period": "Aug 2024 - Mar 2025",
    "location": "Remote",
    "whatWasBroken": "Universities coordinating research across teams using shared spreadsheets. Version conflicts, lost data, no permissions model.",
    "whyAutomationFailed": "Previous attempts used static tools that couldn't handle real-time collaboration. No analytics to understand usage patterns.",
    "whatIBuilt": "Full SaaS platform with RBAC, real-time sync, and analytics dashboard. Role-based access so each team sees only what they should.",
    "outcome": "200+ active users across multiple universities. Replaced manual spreadsheet workflows entirely.",
    "tech": ["Next.js", "TypeScript", "MongoDB", "Firebase"],
    "type": "work"
  },
  {
    "id": "4",
    "title": "Stateful AI therapy assistant with session memory",
    "role": "Lead Developer",
    "period": "Nov 2024 - May 2025",
    "location": "Remote",
    "whatWasBroken": "Mental health apps that forgot context between sessions. Users had to re-explain themselves every time. No continuity of care.",
    "whyAutomationFailed": "Stateless LLM calls. Each conversation started fresh. Sensitive data handled carelessly.",
    "whatIBuilt": "Cross-platform mobile app with conversation memory spanning sessions. Encrypted storage. HIPAA-aligned privacy controls. Custom prompt engineering for therapeutic context.",
    "outcome": "Validated with 10+ healthcare professionals. Multi-session context that actually remembers.",
    "tech": ["React Native", "Expo", "GPT-4 API", "Firebase"],
    "type": "work"
  },
  {
    "id": "5",
    "title": "Event discovery platform shipped in 5 days",
    "role": "Independent Project",
    "period": "Oct 2025",
    "location": "Remote",
    "whatWasBroken": "Finding local events required checking multiple fragmented sources. No unified view.",
    "whyAutomationFailed": "N/A — rapid prototype demonstrating speed to production.",
    "whatIBuilt": "Full-stack app with auth, Maps integration, and agentic AI chain. Serverless architecture for zero-ops.",
    "outcome": "Concept to deployed production in 5 days. Demonstrated ability to ship fast without sacrificing quality.",
    "tech": ["React", "Firebase", "Maps API", "AI"],
    "type": "work"
  }
]
